[
  {
    "url": "https://www.bbc.com/news/live/uk-62866826",
    "text": " And we'll keep you signed in. Sign in  or  Register You need one to watch live TV on any channel or device, and BBC programmes on iPlayer. It’s the law.   Edited by Tiffany Wertheimer All times stated are UK The Princess Royal - along with her husband Vice-Admiral Sir Tim Laurence - accompanied her mother's coffin throughout its six-hour journey from Balmoral to Edinburgh. After winding its way through the countryside, numerous villages and small towns, it has now reached the Palace of Holyroodhouse, and will move to London later this week. Her Majesty's coffin will now lie at rest in The Palace of Holyroodhouse overnight, and then proceed to St Giles Cathedral tomorrow, to allow people to pay their respects for 24 hours. As we've been reporting, her coffin is draped with the Royal Standard for Scotland - a flag that represents the Sovereign. Unlike the Royal Standard used in England, Wales, Northern Ireland and elsewhere, the Royal Standard for Scotland features two quadrants for Scotland as opposed to just one on the Royal Standard. Those quadrants are made up of a gold banner with the Scottish red lion. It is flown at the Palace of Holyroodhouse and Balmoral Castle when the monarch is not present. When they are in residence, the Royal Standard of the UK is flown instead. Crowds applauded as the Queen's coffin was slowly driven along the Royal Mile in Edinburgh to the Palace of Holyroodhouse.  You can watch the historic moment in the video below. The Queen's coffin was greeted with a guard of honour before being carried into Holyroodhouse. The Queen will remain in the throne room of the palace overnight.  As the coffin was taken into the palace, three of the Queen's children looked on - Princess Anne, Prince Andrew and Prince Edward.  King Charles is currently in London but will travel to Edinburgh tomorrow. The Queen's procession has now reached the Palace of Holyroodhouse in Edinburgh - the end of today's six hour journey. The coffin will remain at Holyroodhouse overnight and it will proceed to St Giles' Cathedral on Monday afternoon.  The coffin will remain under continuous vigil for 24 hours, with the public able to pay their respects. Ripples of applause can be heard as the Queen's funeral cortege travels through central Edinburgh. As we mentioned earlier, huge crowds of people have turned out to see Her Majesty's final journey.  The procession will now head to the Palace of Holyroodhouse.  Niall McCracken Reporting from Edinburgh Thousands of people have waited for hours in Edinburgh to pay their respects as the procession makes its way to the palace of Holyroodhouse. “I’ve a\nflight to catch later, but we had to come and pay our respects while we were\nhere,\" said Dillon Hay, who is visiting Scotland from Bangor in Northern Ireland. “I’ve actually found\nit emotional on behalf of my nanny, I rang her and she was in floods of tears.\" It’s an awful loss, I mean you can see the city is absolutely packed with people who have been affected.\" Ian Upritchard is also visiting Edinburgh from Northern Ireland, and describes himself as a “royalist”. “It’s part\nof history being here when the King is crowned. “We went to Holyrood\nPalace and [we've] seen all the floral tributes, it was pretty special.\" It feels unreal to be here, I never dreamt that I’d be present for the Queen’s last journey.\" Andrew Picken Reporting from Edinburgh The cortege is now on the outskirts of Edinburgh. Edinburgh's Royal Mile has been stripped of its regular chaotic beat of bagpipes, street performers and tour guides. In its place is hushed chatter and an air of anticipation. The best city centre vantage points are full; curious tourists and locals mingle along a seemingly endless line of metal barriers. Bradley Harkins, visiting from Chicago, says: \"There's a real sense that something major is happening. I was at the proclamation earlier and it sent shivers down my spine even though today was the first time I'd heard of any of this.\" People clap as the Queen's cortege makes its way through the city of Dundee earlier today. The procession is now crossing the new Queensferry Crossing, linking Fife to Edinburgh. The Queen visited the Forth Road Bridge in 2014 to mark its 50th anniversary and was back just three years later to cut the ribbon on its £1.35bn replacement. Queen Elizabeth II said the Queensferry Crossing, the UK's tallest bridge, was a \"breathtaking sight\" and one of three \"magnificent structures\" across the Forth. The coffin has reached the most southerly point of Fife. It is about to pass Rosyth, where the UK's largest warship was officially named in the Queen's honour in June 2014. She smashed a bottle of whisky against the side of the aircraft carrier at Rosyth dockyard.  Victoria\nCowie, 22, is from Shropshire and studies medicine at the University of St\nAndrews. She lives in Dundee and was in position hours before the cortege reaches the city. “I wanted to come and see the procession because the Queen was an\nincredible person,\" Victoria says. “I saw\nher once in person when she was getting off the train in Shropshire. “I\nthink when the Queen’s procession passes by, it will be a sombre moment. But I\nhope it’s also a celebration of her.\" The cortege has passed Perth and will soon travel through Fife - a short hop from St Andrews where the Queen's grandson William went to university and met his future wife, Catherine. She joined Prince Philip, her son Charles and his wife, Camilla, at the graduation ceremony in June 2005. Here's a picture of that moment: Sean Coughlan Royal correspondent As the cortege travels through Scotland, we're watching the\nfirst steps of a journey that will last more than a week, before culminating at\nthe state funeral next Monday. It's a ceremonial journey with its own narrative. It's going from the homely setting of six Balmoral gamekeepers\nlifting her coffin, to the grandeur of Westminster Abbey in London, where the\npews will be packed with world leaders. When the Queen’s father George VI died in 1952 gamekeepers at\nSandringham had formed a guard of honour for his coffin. Balmoral was one of the Queen’s favourite places, perhaps because it gave her more privacy. Prime ministers visiting there were said to have been surprised to see her doing the washing up after a meal. She's left there now for the last time, with flowers picked from her Scottish estate on the coffin, including white heather, pine fir, phlox, dahlias and sweet peas, which were said to be one of her favourites. Mourners are now gathered in towns along the route, or dotted along the roadside to watch the funeral cortege, with these small groups about to become much bigger crowds, as the journey reaches Edinburgh and then London. Katy Scott Reporting from Dundee Clouds\ndrew in across Scotland’s sunniest city as the Queen Elizabeth made her\nfinal journey through Dundee. As the\nroad grew quiet, the crowd pulled closer to the road and the police cordon in\nanticipation of seeing the late Queen’s coffin. Many\nhundreds fell quiet as the cortège passed through the Kingsway and the people\nof Dundee paid their final respects. A\nscatter of applause broke out among some in the crowd as the Queen’s coffin\npulled up in front of the council leaders of Tayside and Fife and left the city\nfor the last time. Jessica Parker Reporting from Gibraltar At a ceremony in the British overseas territory of Gibraltar,\nCharles III has officially been proclaimed King. Three cheers for His Majesty rang out across a city centre\nsquare as hundreds gathered to watch a military parade and Gibraltar’s\nGovernor, Sir David Steel, read the proclamation from the balcony of his\nofficial residence. Sir David, a retired senior Royal Navy officer, previously\nserved as the Queen’s Aide-de-Camp. Speaking to the BBC, he recalled Her\nMajesty's \"dignity, sense of duty, sense of humour and a love for what she\ndid\". The Rock, as it's often called, lies at the southern tip of the\nIberian Peninsula. Spain has a longstanding claim over the territory but locals\nhave twice, within living memory, voted overwhelmingly to remain British. \"This, to all intents and purposes, is just part of the\nUnited Kingdom separated by 1,000 miles,\" Sir David said. Prince William has spoken to Welsh First Minister Mark Drakeford by phone today, vowing to serve the Welsh people with \"humility and great respect\" in his new role as the Prince of Wales. He said he and Catherine were honoured to have been asked to take on the new roles and would \"spend the months and years ahead deepening their relationship with communities across Wales\", a statement from Kensington Palace said.  Prince William said he and Catherine had a \"deep affection for Wales\", having made their first family home in Anglesey. As Prince and Princess of Wales, the couple \"want to do their part to support the aspirations of the Welsh people and to shine a spotlight on both the challenges and opportunities in front of them\", the statement added. Shaimaa Khalil Reporting from Sydney King Charles III has been officially proclaimed as the ruling monarch of Australia by Governor-General David Hurley in the capital Canberra.  The flags were raised to full-staff as the Australian Army Band Corps played God Save the King for the first time in 70 years. In Sydney, where people gathered outside Parliament House for the state proclamation, there were mixed emotions. “I grew up singing God Save the Queen and today was the\nfirst-time singing God Save The King,\" Litiana Rakarakatia Turner said, on the verge of tears.  \"I’m so proud of Charles but my heart\nbreaks for the Queen.\" \"I'm a proud Australian, and a proud member of the Commonwealth. We’re just here to pay our respects,\" said Jenna Dicello, who was there with her partner and their two little girls. And Henanita Harrop, who was with her 14-month-old daughter, said it was important to bring her to this once in a lifetime event. \"Hopefully when she grows older, she’ll be able to appreciate this wonderful moment, welcoming a new king and giving thanks for the service for her majesty,” Henanita said. Ruth Green Reporting from Dundee People have been gathering along the route in Dundee, hoping to catch a glimpse of the\nfuneral cortege and pay their respects to Queen Elizabeth II. Among them is Samanth Jordan and her 18-month-old son Charlie,\nwho carried his Paddington Bear toy with him. \"We just wanted to pay our respects. We brought Paddington\ndown because Charlie loves him. He was so excited to see the Queen with\nPaddington,\" Samantha says, recalling a video the Queen did with\nPaddington Bear to mark the Platinum Jubilee. \"It's such a sad time.\nWe wanted to come down and be part of the Queen’s final journey. We needed to\nsay goodbye.\" Girlguiding groups and Brownies from across Dundee have also\nbeen gathering to pay their respects. \"The Queen's our patron. She was a member as a child. She’s\nmentioned in our promise and has been an integral part of the organisation. She\nembodies what we stand for,\" Brownie leader Laura Morrison says. \"We make promises to\nhelp our community and the wider world. The Queen encouraged and showed this in\nher life.\" The Queen's funeral cortege is now entering Dundee.  During a trip to the city in 2016, the Queen met with apprentices at the Michelin tyre factory's training school and workshop.  There is now less than three hours left of the journey to Edinburgh.  The Queen's coffin will lie in state in Westminster Hall as King Charles III embarks on a trip around the UK. Her cortege from Balmoral to Edinburgh is wending its way past the villages, towns and cities she knew so well. What messages were sent by Prince William and Catherine, Prince Harry and Meghan, appearing together? Want to lay flowers or sign a book of condolence to remember the Queen? Here's what you need to know. The King says he is \"deeply aware\" of the duties and responsibilities he has inherited as sovereign. How will a former prince used to speaking out on issues he cared deeply about adapt to the neutrality of a monarch?   Wearing the crown at bath time and \"that\" 007 cameo - the Queen's children share treasured memories.         "
  },
  {
    "url": "https://www.bbc.com/news/world-62867569",
    "text": "By Matt MurphyBBC News Antigua and Barbuda will vote on whether to become a republic following the death of Queen Elizabeth II, the country's prime minister has said. Gaston Browne said a referendum could take place within three years - but emphasised that the move was \"not an act of hostility\". He made the comments after confirming Charles III as King and head of state of the Caribbean nation. Mr Browne said he intended to introduce the referendum if re-elected next year. While he expects to win that election - his party holds 15 of the 17 seats in the House of Representatives - he accepted that there hadn't been any major demand to hold a vote among citizens.  \"I think most people haven't even bothered to think about it,\" Mr Browne told ITV News. Earlier, Australia ruled out a similar vote within the next four years.  The Queen's death has reignited Australia's monarchy debate, and Prime Minister Anthony Albanese, who was elected in May, is a republican. But he ruled out a poll in his first term and told Sky News that \"the bigger questions about our constitution are not ones for this current period\".  \"This is a period in which we are sharing the grief that so many Australians are feeling at the moment, showing our deep respect and admiration for the contribution of the Queen to Australia,\" Mr Albanese said.  In addition to the UK, King Charles serves as head of state in 14 countries - Antigua and Barbuda, Australia, The Bahamas, Belize, Canada, Grenada, Jamaica, New Zealand, Papua New Guinea, Saint Kitts and Nevis, Saint Lucia, Saint Vincent and the Grenadines, Solomon Islands, and Tuvalu.  But many countries are reconsidering the role of monarchy, with Mr Browne saying becoming a republic would mark the \"final step to complete the circle of independence to become a truly sovereign nation\".  Last year, Barbados swore in its first president after the Queen was removed as head of state by the country's parliament.  Dame Sandra Mason, 72, the island's governor-general since 2018, was named as president-elect of the nation following a vote in parliament.  And in Jamaica, the ruling Labour Party says its goal is to hold a referendum on becoming a republic.  Barbados becomes the world's newest republic Future for the people to decide - Prince William Queen's coffin arrives in Edinburgh after journey from Balmoral Ukrainian army says it has tripled retaken area Shock and joy in Ukraine's liberated villages What next? A day-by-day guide from now to the funeral Who is in the UK Royal Family and what does the King do? The first few days of King Charles III. VideoThe first few days of King Charles III William and Harry united in grief Queen Elizabeth II: A life in pictures Shock and joy in Ukraine's liberated villages The big issue that could derail UK/US relations 'I want to see the rainbow flag raised in Iran' A glimpse inside the King's first audience with PM. VideoA glimpse inside the King's first audience with PM Watch: The meteoric rise and dramatic fall of Boris Johnson. VideoWatch: The meteoric rise and dramatic fall of Boris Johnson Germany's 'time-warp' town The radical books rewriting sex Â© 2022 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
  },
  {
    "url": "https://www.bbc.com/news/world-europe-62867560",
    "text": "By Hugo Bachega and Orla Guerin in Ukraine and Matt Murphy in London BBC News This video can not be played Watch: Ukrainian military enter key city of Kupiansk Ukraine's military says its forces have retaken over 3,000 sq km (1,158 sq miles) during a rapid counter-offensive in eastern Ukraine. The remarkable advance, if confirmed, means Kyiv's forces have tripled their stated gains in little over 48 hours.  On Thursday evening, President Zelensky put the figure at 1,000 sq km, and then 2,000 sq km on Saturday evening. The BBC cannot verify the Ukrainian figures, and journalists have been denied access to the frontlines. On Saturday, the eastern counter-attack saw Ukrainian troops enter the vital Russian-held supply towns of Izyum and Kupiansk.  But UK defence officials have warned that fighting has continued outside those towns. And officials in Kyiv said Ukrainian forces were still fighting to gain control of a number of settlements around Izyum. Russia's defence ministry confirmed its forces' retreat from Izyum itself and Kupiansk, which it said would allow them\"to regroup\" in territory held by Moscow-backed separatists.  The Russian ministry also confirmed the withdrawal of troops from a third key town, Balaklyia, in order to \"bolster efforts\" on the Donetsk front. Ukrainian forces entered the town on Friday.  The pace of the counter-attack has caught the Russians off guard, and Chechen leader Ramzan Kadyrov - a staunch supporter of President Vladimir Putin - appeared to question Moscow's military strategy.  In a message posted to Telegram, Mr Kadyrov said if there was not a change in Russia's fortunes, he would be forced to question the country's leadership to explain the situation. On Saturday, the head of the Russia-installed administration in the Kharkiv region recommended that its people evacuate to Russia \"to save lives\".  Unverified footage on social media appeared to show long queues of traffic building up at border crossings. The governor of the Belgorod border region in Russia, Vyacheslav Gladkov, said \"thousands\" of people had crossed into the country. Meanwhile, Gen Valerii Zaluzhnyi, commander of Ukraine's military, said his forces had advanced to within 50km (31 miles) of the Russian border.  But Russians still hold around a fifth of the country, and few imagine a swift end to the war.  In an interview with the Financial Times, Ukraine's defence minister Oleksii Reznikov hailed his troops, but warned of the potential for a Russian counter-attack.  \"A counter-offensive liberates territory and after that you have to control it and be ready to defend it,\" Mr Reznikov said. \"Of course, we have to be worried, this war has worried us for years.\"  The Ukrainian advances - if held - would be the most significant frontline changes since Russia withdrew from areas around Kyiv in April.  Kupiansk served as Russia's main eastern supply hub and the loss of Izyum - which Moscow spent over a month trying to take at the beginning of the war - would be seen as a major humiliation for President Vladimir Putin.  According to one military expert, the advance marks the first time since World War Two that whole Russian units have been lost. The gains will also be seen as a sign that Ukraine's army has the capacity to retake occupied territory - crucial as Kyiv continues to ask hard-pressed Western allies for military support.  Ukraine's foreign minister, Dmytro Kuleba, said the latest developments showed its forces could end the war faster with more Western weapons. Ukraine launched its counter-offensive in the east earlier this week, while international attention was focused on an anticipated advance near the southern city of Kherson.  Analysts believe Russia redirected some of its most seasoned troops to defend the city.  In addition to gaining ground in the east, Ukraine is also making gains in the south, an official said.  Nataliya Gumenyuk, a spokesperson for the Ukrainian army's southern command, said they had advanced \"between two and several dozens of kilometres\" along that front.  But Russian forces fighting on the southern front are said to have dug into defensive positions, and Ukraine's troops have faced heavy resistance since the offensive began. And in Kharkiv itself, one person was killed and several homes damaged on Saturday as Russian rocket fire hit the city, according to local officials.  Elsewhere, Ukraine's energy regulator, Energoatom, says the last reactor at the Russian-occupied Zaporizhzhia nuclear power plant has been shut down, and is not generating electricity. The reactor had been generating energy for the plant itself for three days - it was shut down when external power was restored. The Ukrainian operator said that to prevent an emergency, it was essential that shelling of the power lines connecting the station to the national grid be halted.    Ukraine retakes 1,000 square kilometres - Zelensky Queen's coffin arrives in Edinburgh after journey from Balmoral Ukrainian army says it has tripled retaken area Shock and joy in Ukraine's liberated villages What next? A day-by-day guide from now to the funeral Who is in the UK Royal Family and what does the King do? The first few days of King Charles III. VideoThe first few days of King Charles III William and Harry united in grief Queen Elizabeth II: A life in pictures Shock and joy in Ukraine's liberated villages The big issue that could derail UK/US relations 'I want to see the rainbow flag raised in Iran' A glimpse inside the King's first audience with PM. VideoA glimpse inside the King's first audience with PM Watch: The meteoric rise and dramatic fall of Boris Johnson. VideoWatch: The meteoric rise and dramatic fall of Boris Johnson Germany's 'time-warp' town The radical books rewriting sex Â© 2022 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
  },
  {
    "url": "https://www.bbc.com/news/world-europe-62869157",
    "text": "By Orla GuerinBBC News, Kryvyi Rih, Ukraine Natalia's face lights up as she recalls the moment of her liberation - when the hated occupiers were forced from her village, Novovoznesenske, in the southern region of Kherson. She farmed there in peace and quiet until the Russians arrived on 29 March. What they did not destroy, they stole, she says, including forks and spoons, and the shoes from a pensioner's feet.  \"They were a rabble,\" she tells me, wringing her hands as she relives her trauma. Freedom finally came on 2 September. \"When our armed forces arrived, we were in the basement,\" says the 50-year-old. \"They asked, in Ukrainian, 'is anyone alive?' and I realised they were ours. They were so handsome, so beautiful especially compared to the fascists [her term for Russian forces].  \"I didn't know what to do with them - if I should hug them or hold their hands? I touched them and I was very happy.\" After months of deadlock, Ukrainians - and Russians - are facing a new reality. Suddenly there is momentum in the largest conflict in Europe since World War Two.  Ukrainian forces have advanced, and Russian forces have beaten a hasty retreat - critically from strategic locations in the eastern region of Kharkiv. They have lost the cities of Kupiansk, a crucial logistics hub, and Izyum, a launchpad for attacks. \"The Russian army is rushing to get famous as the fastest army in the world,\" wrote Andriy Yermak - chief of staff for President Volodymyr Zelensky - on Twitter. \"Keep running\". Social media here has been flooded with images of abandoned or destroyed Russian positions, and Ukrainian forces raising their flag in newly liberated areas. The speed - and breadth - of the counter-offensive has surprised the occupiers, and many Ukrainians. One Ukrainian colleague pronounced himself \"shocked, pleasantly so\".  \"We needed a loud victory to cheer us up,\" he says, \"and it looks like there is a domino effect in Kharkiv. But they still have weapons and troops and lots of our territory. People still understand who our neighbour is. But there's less fear and more confidence.\" The advances have given a war-torn nation a shot in the arm, after grinding losses over the summer in the Donbas region.  When we reported from there in June there was no indication that Ukrainian forces might be able to mount such a strong counterattack. \"It's a military miracle,\" says Mykhailo, a 38-year-old IT engineer. The \"miracle\" has been achieved with plenty of foreign weaponry - including long-range multiple rocket launch systems - and foreign intelligence.  It also looks like the Ukrainians outsmarted the Russians, not for the first time, by talking up plans to counter-attack in the southern Kherson region.  The Kremlin appears to have taken the bait, redeploying some forces there, leaving their positions in Kharkiv dangerously exposed. But the offensive has also shown that the Ukrainians can beat the Russians on the battlefield, according to Western military experts.  \"We are now seeing the Russians being defeated, not just outmanoeuvred,\" says Professor Michael Clarke, former Director of the Royal United Services Institute. He views this as \"an early turning point\". On Saturday, President Zelensky said his country's armed forces had recovered around 2,000 sq km (770 square miles) since the beginning of September. On Sunday morning, the army put it even higher, at 3,000 sq km. For now, journalists - including those from the BBC - are being kept away from the frontlines. We cannot verify all of Ukraine's claims - but Russia admits its troops have withdrawn from parts of Kharkiv, claiming they were \"regrouped\" rather than driven out. Despite Ukraine's recent progress, the Russians still hold around a fifth of Ukraine - including the city of Kherson.  It was the first major Ukrainian city to fall after the invasion and is just north of the Crimean peninsula (held by Russia since 2014). We managed to reach a woman still living there - who says the Russians are starting to lie low. For her protection we are not naming her. \"Over the past two or three days, the military seem to have quietened down a bit,\" she tells us.  \"They are less visible in cafes and restaurants. If street fighting starts it will be very dangerous. But I will sit in the basement for days or weeks if needs be. I want to see our army here and thank them. I want to see the victory.\" Also waiting for victory is a network of activists inside the city, who are resisting the Russians. They gather intelligence on military positions and pass this to Ukrainian forces.  A member of the resistance - who we cannot identify - told us they are being hunted. \"The Russians are finding places where photos are being taken,\" he says. \"There are mass searches of flats close to strategic vantage points. There have been two cases in the past week when people were taken from the streets.\" But he says the news from the frontline is bringing hope. \"People are now very encouraged by the advance around Kharkiv,\" he told us. \"Many hope that we will be next.\" Kherson city is a critical battle to come, but the advances so far have been cathartic for Ukraine and reassuring for its Western backers. If the gains are held, this could change the arc of the conflict. No one expects President Putin to throw in the towel. When it comes to Ukraine, he takes the long (and obsessional) view.  But in places Russia's frontlines have completely collapsed and its troops have fled. That's not just a defeat. It's a humiliation. This video can not be played Watch: Ukrainian military make further gains entering Kupiansk Ukrainian army says it has tripled retaken area Queen's coffin due to arrive in Edinburgh shortly Ukrainian army says it has tripled retaken area Shock and joy in Ukraine's liberated villages What next? A day-by-day guide from now to the funeral Who is in the UK Royal Family and what does the King do? The first few days of King Charles III. VideoThe first few days of King Charles III William and Harry united in grief Mark Easton: Our unsettled kingdom seeks a steady hand Queen Elizabeth II: A life in pictures Shock and joy in Ukraine's liberated villages The big issue that could derail UK/US relations 'I want to see the rainbow flag raised in Iran' Watch: The meteoric rise and dramatic fall of Boris Johnson. VideoWatch: The meteoric rise and dramatic fall of Boris Johnson Germany's 'time-warp' town The radical books rewriting sex Â© 2022 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
  },
  {
    "url": "https://www.bbc.com/news/uk-62867444",
    "text": "By Doug FaulknerBBC News This video can not be played Watch: Queen's coffin arrives in Edinburgh Queen Elizabeth II's cortege has arrived in Edinburgh following a six-hour journey from Balmoral. Mourners lined the streets as the hearse travelled from Aberdeenshire to the Palace of Holyroodhouse, where her coffin will rest overnight. Her coffin will then lie under vigil in Edinburgh's St Giles' Cathedral on Monday before heading to London ahead of her funeral on Monday 19 September. Crowds have also gathered to hear King Charles III proclaimed across the UK. He will travel up to Scotland on Monday and will be joined by members of the Royal Family as he accompanies his mother's coffin to the cathedral in the Scottish city. The Queen's cortege left her home at Balmoral at around 10:00 BST, winding through Aberdeen and Dundee among other villages and towns, on its way to Edinburgh. As it drove through Edinburgh city centre, some six hours later, silence fell before there was applause from the crowd that had gathered there. The Princess Royal, Princess Anne, travelled in the second car of the cortege on the 175-mile journey, accompanied by her husband, Vice Admiral Sir Tim Laurence.   She curtsied as her mother's coffin was carried into Holyroodhouse - the monarch's official residence in Scotland. The Duke of York and Duke and Duchess of Wessex, who were there to receive the coffin, also bowed and curtsied respectively, alongside palace staff. The country is in a period of national mourning until after the Queen's funeral next Monday. A series of constitutional and ceremonial events will take place over the coming days. This video can not be played Aerials show the Queen's last journey from Balmoral Earlier at the start of the journey, six gamekeepers from her Balmoral estate placed the Queen's oak coffin into a hearse before she left Balmoral, her beloved private Scottish estate, for the final time. The wreath on top of the coffin features some of the Queen's favourite flowers, all cut from the estate - white heather, dahlias and sweet peas, phlox and pine fir. When the cortege reached Ballater, Aberdeenshire - the closest village to Balmoral - flowers were thrown in the road by mourners, many of whom regard the Queen and the Royal Family as neighbours. The coffin will remain under continuous vigil for 24 hours at St Giles' Cathedral, with the public able to pay their respects. A service will be held at the cathedral in the evening. The following day, Princess Anne will accompany her mother's coffin as it travels from Edinburgh Airport back to Buckingham Palace, via RAF Northolt.  In Windsor, thousands gathered in the town to pay tribute to the Queen.  Roads were closed, as floral tributes and cards continued to be placed outside the castle gates. And in Green Park, near Buckingham Palace, thousands more floral tributes were placed in memory of the Queen. Latest updates as Queen's coffin arrives in Edinburgh What next? A day-by-day guide from now to the funeral How titles and the line of succession have changed Queen's coffin: Route from Balmoral to Edinburgh Bank holiday approved for day of Queen's funeral Charles praises Queen's reign as he is proclaimed king William and Harry united in grief Queen's coffin arrives in Edinburgh after journey from Balmoral Ukrainian army says it has tripled retaken area Shock and joy in Ukraine's liberated villages What next? A day-by-day guide from now to the funeral Who is in the UK Royal Family and what does the King do? The first few days of King Charles III. VideoThe first few days of King Charles III William and Harry united in grief Queen Elizabeth II: A life in pictures Shock and joy in Ukraine's liberated villages The big issue that could derail UK/US relations 'I want to see the rainbow flag raised in Iran' A glimpse inside the King's first audience with PM. VideoA glimpse inside the King's first audience with PM Watch: The meteoric rise and dramatic fall of Boris Johnson. VideoWatch: The meteoric rise and dramatic fall of Boris Johnson Germany's 'time-warp' town The radical books rewriting sex Â© 2022 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking. "
  }
]